//* JavaScript Date Formats
//  รูปแบบการป้อนวันที่ของ JavaScript โดยทั่วไปมี 3 ประเภท
//TODO:  Type         Example
//?      ISO Date     "2015-03-25" (มาตรฐานสากล)
//?      Short Date   "03/25/2015"
//?      Long Date    "Mar 25 2015" or "25 Mar 2015"
//รูปแบบ ISO เป็นไปตามมาตรฐานที่เข้มงวดใน JavaScript
//รูปแบบอื่นไม่ได้กำหนดไว้อย่างดีและอาจเป็นเบราว์เซอร์เฉพาะ

//* 1. JavaScript ISO Dates
//  Example (Complete date)
{
    // Wed Mar 25 2015 07:00:00 GMT+0700 (เวลาอินโดจีน)
    const d = new Date("2015-03-25");
}

//  ISO Dates (Year and Month)
{
    // Sun Mar 01 2015 07:00:00 GMT+0700 (เวลาอินโดจีน)
    const d = new Date("2015-03");
}

//  ISO Dates (Only Year)
{
    // Thu Jan 01 2015 07:00:00 GMT+0700 (เวลาอินโดจีน)
    const d = new Date("2015");
}

//  ISO Dates (Date-Time)
//  สามารถเขียนวันที่ ISO โดยเพิ่มชั่วโมง นาที และวินาที (YYYY-MM-DDTHH:MM:SSZ)
{
    // Wed Mar 25 2015 19:00:00 GMT+0700 (เวลาอินโดจีน)
    const d = new Date("2015-03-25T12:00:00Z");
}

//  วันที่และเวลาคั่นด้วยตัวพิมพ์ใหญ่ T.
//  เวลา UTC กำหนดด้วยอักษรตัวใหญ่ Z
//  หากคุณต้องการแก้ไขเวลาที่สัมพันธ์กับ UTC ให้ลบ Z ออกและเพิ่ม +HH:MM หรือ -HH:MM แทน
{
    // Thu Mar 26 2015 01:00:00 GMT+0700 (เวลาอินโดจีน)
    const d = new Date("2015-03-25T12:00:00-06:30");
}
//  UTC (เวลาสากลเชิงพิกัด) เหมือนกับ GMT (เวลามาตรฐานกรีนิช)
//! การละเว้น T หรือ Z ในสตริงวันที่และเวลาสามารถให้ผลลัพธ์ที่แตกต่างกันในเบราว์เซอร์ต่างๆ

//* 2. Time Zones
//  เมื่อตั้งค่าวันที่โดยไม่ระบุโซนเวลา JavaScript จะใช้โซนเวลาของเบราว์เซอร์
//  เมื่อรับวันที่โดยไม่ระบุโซนเวลา ผลลัพธ์จะถูกแปลงเป็นโซนเวลาของเบราว์เซอร์

//  JavaScript Short Dates.
//  วันที่แบบสั้นเขียนด้วยรูปแบบ "MM/DD/YYYY" ดังนี้
{
    // Wed Mar 25 2015 00:00:00 GMT+0700 (เวลาอินโดจีน)
    const d = new Date("03/25/2015");
}
//! WARNINGS !
//  ในบางเบราว์เซอร์ เดือนหรือวันที่ไม่มีศูนย์นำหน้าอาจสร้างข้อผิดพลาด
//  ลักษณะการทำงานของ "YYYY/MM/DD" ไม่ได้ถูกกำหนด
//  บางเบราว์เซอร์จะพยายามคาดเดารูปแบบ บางคนจะคืน NaN
//? const d = new Date("2015/03/25");

//  ลักษณะการทำงานของ "DD-MM-YYYY" ก็ยังไม่ได้กำหนดเช่นกัน
//  บางเบราว์เซอร์จะพยายามคาดเดารูปแบบ บางคนจะคืน NaN
//? const d = new Date("25-03-2015");


//* 3. JavaScript Long Dates.
{
    // วันที่แบบยาวมักจะเขียนด้วยไวยากรณ์ "MMM DD YYYY" ดังนี้
    const d1 = new Date("Mar 25 2015"); //Wed Mar 25 2015 00:00:00 GMT+0700 (เวลาอินโดจีน)
    
    // เดือนและวันสามารถเรียงลำดับอย่างไรก็ได้
    const d2 = new Date("25 Mar 2015"); //Wed Mar 25 2015 00:00:00 GMT+0700 (เวลาอินโดจีน)

    // เดือนสามารถเขียนแบบเต็ม (มกราคม) หรือตัวย่อ (ม.ค.)
    const d3 = new Date("January 25 2015"); //Sun Jan 25 2015 00:00:00 GMT+0700 (เวลาอินโดจีน)
    const d4 = new Date("Jan  25 2015"); //Sun Jan 25 2015 00:00:00 GMT+0700 (เวลาอินโดจีน

    // เครื่องหมายจุลภาคจะถูกละเว้น ชื่อไม่คำนึงถึงตัวพิมพ์เล็กและใหญ่
    const d5 = new Date("JANUARY, 25, 2015"); //Sun Jan 25 2015 00:00:00 GMT+0700 (เวลาอินโดจีน)
}

//* 4. Date Input - Parsing Dates
//  หากคุณมีสตริงวันที่ที่ถูกต้อง คุณสามารถใช้ Date.parse()วิธีการแปลงเป็นมิลลิวินาทีได้
//  Date.parse()ส่งกลับจำนวนมิลลิวินาทีระหว่างวันที่ถึง 1 มกราคม 1970
{
    let msec = Date.parse("March 21, 2012"); //1332262800000
    const d = new Date(msec); //Wed Mar 21 2012 00:00:00 GMT+0700 (เวลาอินโดจีน)
}